{
    "id": "captain-america-the-winter-soldier", 
    "name": "Captain America: The Winter Soldier", 
    "plot": [
        "Two years after the Battle of New York, Steve Rogers continues working under the alias of Captain America as an agent of the espionage agency S.H.I.E.L.D.. While out on a morning jog in Washington D.C., Rogers frequently passes a man who later introduces himself as Sam Wilson, a veteran U.S. Air Force pararescue trooper who now works as a counselor at the U.S. Department of Veterans Affairs. After the jog, Wilson and Rogers share and bond over their common experiences in adapting to life after each serving tours in the armed forces. Natasha Romanoff arrives to take Rogers with her on a mission to rescue the hostages of the S.H.I.E.L.D. vessel Lemurian Star, which had been taken over by a group of hired pirates led by Georges Batroc.  Rogers, Romanoff, and Brock Rumlow, along with other members of the elite S.H.I.E.L.D. branch STRIKE, eliminate the pirates and rescued the hostages. However, mid-mission Rogers discovers that Romanoff had gotten her own secret mission from Director Nick Fury to extract the S.H.I.E.L.D. intelligence from the ship onto a USB drive. This sparked suspicion from Rogers as Romanoff's disappearance nearly jeopardized the mission. Back at the Triskelion, Rogers is angry with Fury for lying to him. Fury, as a sign of trust, takes Rogers to the basement where he introduces Rogers to Project Insight. Project Insight consists of three (3) next generation S.H.I.E.L.D. Helicarriers that will be launched into the air and connected to Project Insight satellites at 3000 feet in the air to neutralize enemy hostile targets. Fury tells Rogers that 'S.H.I.E.L.D. takes the world as it is, not as we like it to be,' but Rogers responds that, 'This isn't freedom. This is fear...'",
        "Later, Rogers visits the Captain America exhibit at the Smithsonian Institution and also visits Peggy Carter in a retirement home. Carter suffers from some form of dementia. He also meets with Wilson again after watching him speaking during the end of a session for veterans with Post-Traumatic Stress Disorder (PTSD). Meanwhile Fury discovered that the data on the USB is inaccessible. He tells this to Alexander Pierce, who had just concluded a meeting with the World Security Council about the high-jacking of the Lemurian Star. Fury asks Pierce to make a formal request to the Council to delay Project Insight due to Fury's underling suspicions. Fury leaves the Triskelion and is in-route to meet with Maria Hill when he is attacked by assassins impersonating policemen. He gets away but is then soon stopped by a masked man in the middle of the road who shoots a Magnetic Disk Grenade under Nick Fury's SUV, flipping it. However, before the masked man gets to Fury, he manages to use a hi-tech device to cut through the street and escape into the sewers.",
        "Rogers arrives to his apartment and, after talking to his neighbor, becomes suspicious when he hears that his stereo is still on. He sneaks in through the window and finds Nick Fury sitting in a chair in the dark. He tells Rogers that his wife kicked him out, while communicating through written text on his phone that his story is misdirection because they are being eavesdropped upon. Fury tells Rogers that S.H.I.E.L.D. has been compromised, before being shot several times by the masked man standing on the adjacent building. Fury gives the USB thumb drive to Rogers and tells him not to trust anyone, before falling unconscious. Rogers' neighbor smashes in the door, revealing herself to be Agent 13, who had been tasked by Fury to keep an eye on Rogers. He then pursues the masked man, jumping through the window into the next-door office building. He throws his shield at the masked man on the rooftop, but surprisingly the man is able to catch the shield with his cybernetic arm and throws it back before jumping off of the building and disappearing.",
        "Fury is taken to a hospital in critical condition. His heart stops during surgery, and after the doctors fail to revive him, his body is collected by Maria Hill. Rumlow tells Rogers he is wanted at the Triskelion for an urgent meeting. Feeling suspicious, Rogers quickly hides the USB in a vending machine and leaves. At the Triskelion, he is questioned by Pierce, who says he is one of Fury's oldest friends and wants to know who killed him. Rogers does not trust Pierce and says nothing about the USB or the circumstances of Fury's death, merely reiterating that Fury said not to trust anyone. He leaves Pierce to go to the hospital. While in the elevator, Rogers is joined by several STRIKE operatives, and soon realizes they are there to kill him. He fights the attackers and successfully knocks them all out, before jumping out the elevator to avoid arrest. After landing, he drives away on his motorcycle and evades an attacking Quinjet. Pierce then declares Rogers a fugitive to be taken out by S.H.I.E.L.D. for withholding information on Fury's death. Pierce is working with the masked man when the Undersecretary shoots his house cleaner Renata for accidentally seeing the two men talking together in his home.",
        "Rogers arrives later at the hospital, where he notices that the USB is gone. Romanoff appears and reveals that she had taken it and he angrily asks her what she knows about all that has happened. She tells him that the masked man is a spy known as the Winter Soldier, and she had encountered him once before. She decides to follow Rogers. They go to an Apple store to see if they can access any of the valuable information on the USB. But they, as Fury did, find nothing. However they are able to trace the location where the program on the USB was written. Rumlow and his team arrive and try to find them but fail to do so. They steal a truck and drive to the location while talking about each other's past. When they arrive Rogers realizes that they are at the old training facility where he trained during World War II. They find a secret storage room full of old computers inside a early S.H.I.E.L.D. office. There they find a more modern-looking USB slot and they put the USB in. The computers power up and someone starts to talk to them.",
        "It is Arnim Zola, who tells them that he was recruited by S.H.I.E.L.D. after World War II, and that he helped to rebuild HYDRA inside S.H.I.E.L.D. However, in the 1970s, when he received the news that his body was dying (and with S.H.I.E.L.D. still needing his help), he had his mind transferred into computers. He had been working on an algorithm that HYDRA wanted. He told Rogers and Romanoff that some of the deaths of S.H.I.E.L.D. leaders had been due to HYDRA, while showing them a picture of Howard Stark and implying that Stark's death might not have been an accident. He was also involved in the Winter Soldier program. But before Rogers and Romanoff can get any more information out of Zola, a S.H.I.E.L.D. jet shows up and destroys the bunker. Rogers and Romanoff are able to survive the explosion and seek refuge with Sam Wilson. Wilson tells them that he can offer them assistance as he part of a military project involving advanced personal flight suits.",
        "Rogers and Romanoff then went back to Washington, D.C., to capture Agent Jasper Sitwell, who is working for HYDRA. Sitwell had just finished a meeting with Senator Stern, a fellow HYDRA conspirator, when Wilson called Sitwell and forced him up on the roof of a tall building. Wilson, working with Romanoff and Rogers, gets Sitwell to inform them that Zola's algorithm could calculate if a person would be a threat in the future based on their past actions. Sitwell also told the three that HYDRA are going to use Project Insight as a weapon to eliminate what they view as threats against themselves and the world, mentioning Tony Stark, Bruce Banner and Stephen Strange, though this would also mean that millions of innocent people would die.",
        "The gang head towards the Triskelion, but are attacked by the Winter Soldier and his men. A battle breaks out, and as Captain America and the Winter Soldier fight, the Winter Soldier's mask is torn off, revealing himself as Roger's former comrade and best friend Bucky Barnes. Rogers tries to recognize him (saying, Bucky?), but Barnes doesn't recall his own name. Barnes escapes and Rogers, Romanoff, and Wilson are taken into custody by Rumlow and his men. While in the prison van, one of the guards stuns the other guard, revealing herself to be Maria Hill. She then uses a device to cut a hole in the van and escapes with the gang.",
        "Hill takes them to a secret facility where Fury is resting, revealing that the director didn't die, although he was severely injured. Fury had taken a anti-stress serum (developed by Bruce Banner) that lowered his heartbeat to only one beat per minute so that he would appear dead. Hill and Fury tell them that Project Insight is only hours away and that they had to act quickly. The Helicarriers would reach 3000 feet, connect to the Insight Satellites, and target all its targets before firing. The only way to prevent this was to use three special chips that would take away S.H.I.E.L.D.'s control over the Helicarriers.",
        "As Rogers had lost his suit earlier, he breaks into the Captain America exhibit at the Smithsonian and steals the costume that was on display. Barnes is being prepared for battle, but he starts to ask who 'Bucky' is. Pierce decides he is beginning to remember too much about his past and they brainwash him again. He sees memories showing how HYDRA's Russian division found him in suspended animation after falling off the train. It is then that Doctor Zola amputated his destroyed left arm and replaced it with a cybernetic one. He also remembers how he was put in Cryostasis between missions so that he would not age.",
        "The members of the World Security Council arrive at the Triskelion. The members of the World Security Council are each given badges to wear on their collar that will grant them access to anywhere in the Triskelion. They then meet in Alexander Pierce's office. Rogers and Sam, a.k.a. Falcon, break into the Triskelion and take control of the communication systems. Rogers reveals to the staff that there are HYDRA infiltrators in S.H.I.E.L.D., led by Pierce, and that they cannot be allowed to initiate Project Insight. Rumlow and his men enter the control room and threaten to shoot the agent in charge of launching the Helicarriers if he doesn't get the Helicarriers in the air immediately. However, Agent 13 intervenes, beginning a gunfight, but Rumlow still manages to get the Helicarriers in the air.",
        "Pierce pulls a gun on Councilman Singh, but Romanoff, using a Photostatic Veil and disguised as Councilwoman Hawley, stops him. She then calls for Fury, who is a top-ranking S.H.I.E.L.D agent, and since two top-ranking S.H.I.E.L.D agents are needed to upload all of S.H.I.E.L.D.'s secure files to the Internet along with all of HYDRA's, they force Pierce to give his retinal scan. Fury states that Pierce probably erased all traces of Fury being the director of S.H.I.E.L.D., but that Fury had made a backup retinal scan using his damaged eye instead of his normal, working eye. However Pierce refuses to be taken in and triggers a button on his device that remotely controls the security badges on the World Security Council members' collars that instantly kills them by burning a hole in their sternums. Pierce blackmails Romanoff to fly him out of the Triskelion or otherwise he will activate the electronic device on her collar that will kill her. Romanoff quickly activates one of her Taser Disks, which temporarily disables the bomb device on her collar for a split second, giving Fury enough time to shoot Pierce and kill him.",
        "They manage to put the chips, with some hardship, for two of the Helicarriers in the right place, but when Wilson is going for the last one his jetpack is damaged by Barnes and he is forced to skydive down to the Triskelion where he gets caught up in a fistfight with Agent Rumlow. Rogers is about to put the chip in place before he is confronted by Bucky. Rogers and the Barnes fight, and during the fight Rogers tries to convince Barnes that he was good once upon a time. As he tries to get the chip in place with only seconds left before Project Insight will initiate he gets shot multiple times by Bucky. He manages to get the chip on the Helicarrier, though, and Agent Hill takes control of the other Helicarriers and shoots down the Project Insight Helicarriers. Before Rogers passes out, he promises Barnes to be with him until the end, a promise Barnes gave Rogers decades ago. Rogers then falls into the water beneath and is about to drown, when a hand grabs him and drags him out of the water. It is Barnes, who then disappears.",
        "Wilson jumps out of the 41st floor through the window and is saved by Fury and Romanoff. Rumlow is buried under rubble but is later seen being attended to by doctors. When Rogers wakes up some time later, a lot of new events have happened. S.H.I.E.L.D. is unstable at the moment due to HYDRA . Nick Fury is officially dead and he has destroyed all evidence of being alive, even ditching the eye-patch for sunglasses. If somebody would ask what happened with Fury, he wanted Rogers to answer that he was dead. Romanoff appeared in a court hearing at Capitol Hill with the high ranking Senators to discuss who was responsible for S.H.I.E.L.D.'s downfall. Because all of S.H.I.E.L.D.'s secure files were uploaded to the internet, along with Romanoff's past, she sets out to find herself a new identity after handing Rogers a file with information on Barnes and his experimental origins. Rogers looks at the file. Wilson realizes that Rogers is going to look for Barnes. Rogers decided to start looking for his friend, with the help of Wilson, so that he can convince him of who he really is. Rogers tells him that he doesn't have to go with him. Wilson replies, 'I know. When do we start?'",
        "Sometime later, Baron Wolfgang von Strucker is holding the Chitauri Scepter, stating that there are HYDRA agents worldwide. He then walks over to a pair of cells. He stops in front of them and says, 'This is the age of miracles...' One of the cells contains a man who is running around at a tremendous speed. The other one contains a woman who levitates a few blocks, before she causes one to explode. The two are said to be twins, the only survivors of a group of volunteers that were subjected to Von Strucker's experiments. Meanwhile, Barnes, dressed in civilian clothing, is at the Smithsonian Institution where he finds a whole section of the Captain America display dedicated to him."
    ], 
    "director": [
        "Joe Russo",
        "Anthony Russo",
        "Joss Whedon (mid-credits-scene)"
    ],
    "producers": [
        "Kevin Feige",
        "Victoria Alonso",
        "Mitchell Bell",
        "Alan Fine",
        "Louis D'Esposito",
        "Stan Lee"
    ],
    "screenwriters": [
        "Stephen McFeely",
        "Christopher Markus"
    ],
    "castnames": [
        "Chris Evans as Steve Rogers / Captain America",
        "Samuel L. Jackson as Nick Fury",
        "Scarlett Johansson as Natasha Romanoff / Black Widow",
        "Robert Redford as Alexander Pierce",
        "Sebastian Stan as Bucky Barnes / Winter Soldier",
        "Anthony Mackie as Sam Wilson / Falcon",
        "Cobie Smulders as Maria Hill",
        "Frank Grillo as Brock Rumlow",
        "Maximiliano Hernández as Jasper Sitwell",
        "Emily VanCamp as Kate / Agent 13",
        "Hayley Atwell as Peggy Carter",
        "Toby Jones as Dr. Arnim Zola",
        "Stan Lee as Smithsonian Guard",
        "Callan Mulvey as Jack Rollins",
        "Jenny Agutter as Councilwoman Hawley"
    ], 
    "castprofiles": [
        "img/marvel/chris-evans.jpg",
        "img/marvel/samuel-l-jackson.jpg",
        "img/marvel/scarlett-johansson.jpg",
        "img/marvel/robert-redford.jpg",
        "img/marvel/sebastian-stan.jpg",
        "img/marvel/anthony-mackie.jpg",
        "img/marvel/cobie-smulders.jpg",
        "img/marvel/frank-grillo.jpg",
        "img/marvel/maximiliano-hernandez.jpg",
        "img/marvel/emily-vancamp.jpg",
        "img/marvel/hayley-atwell.jpg",
        "img/marvel/toby-jones.jpg",
        "img/marvel/stan-lee.jpg",
        "img/marvel/callan-mulvey.jpg",
        "img/marvel/jenny-agutter.jpg"
    ], 
    "releasedate": "April 4, 2014",
    "runningtime": "136 minutes",
    "boxoffice": 714.1,
    "genre": "Action, Adventure, Sci-Fi",
    "rating": "7.8 / 10",
    "trailer": "https://www.youtube.com/v/7SlILk2WMTI",
    "images": [
        "img/marvel/captain-america-the-winter-soldier-00.jpg",
        "img/marvel/iron-man-00.jpg",
        "img/marvel/iron-man-2-00.jpg"
    ]
}