{
    "id": "captain-america-the-first-avenger", 
    "name": "Captain America: The First Avenger", 
    "plot": [
        "In the present day, researchers in the Arctic Circle uncover the buried wreckage of a large, wing shaped aircraft. While investigating the aircraft's interior, two of the researchers discover a frozen, circular object with a red, white and blue motif. In March 1942, Johann Schmidt, commanding officer of the Nazi science division HYDRA and his men invade a stone church in Tønsberg, Norway, seeking a mysterious cosmic artifact known as the Tesseract, which possesses untold powers. Upon discovering the true Tesseract, Schmidt has the Church Keeper who guarded it killed, along with everyone else in the village. Meanwhile, in New York City, Steve Rogers is once again rejected for military duty on the battlefields of World War II, despite making multiple attempts at different enlistment offices, due to his frail physical appearance and numerous health issues. While attending an exposition of future technologies with his friend Bucky Barnes, Rogers attempts to enlist again. After Overhearing Rogers' conversation with Barnes about wanting to help in the war, Dr. Abraham Erskine allows Rogers to enlist as a candidate of Project Rebirth, a “super-soldier” experiment being conducted by the Strategic Scientific Reserve under the supervision of Erskine, Colonel Chester Phillips, and British Agent Peggy Carter.",
        "During basic training, Colonel Phillips is unconvinced by Erskine's claims that Rogers is the right person for the procedure, but relents after seeing Rogers commit an act of self-sacrificing bravery. The night before the treatment, Erskine reveals to Rogers that Schmidt underwent an imperfect version of the procedure and suffered negative side-effects due to his inner ambition for power and obsession with becoming a “superior man”. However, he reassures Rogers that he chose him because he believed Rogers was an inherently good man and one that, because he had been weak his whole life, would not loose respect for the strength he would gain. Back in Europe, Schmidt and Dr. Arnim Zola, using one of Dr. Zola's machines, successfully harness the energies of the Cosmic Cube, intending to use the power to fuel Zola's inventions. Meanwhile, Schmidt, having discovered Erskine's location, dispatches an assassin to kill him.",
        "In New York, Erskine subjects Rogers to the super-soldier treatment, putting him in a special chamber where he is injected with the Super Soldier Serum and dosed with 'vita-rays'. Rogers emerges from the chamber taller and with an enhanced physique. After witnessing the success of the experiment, one of the attendees reveals himself to be Schmidt's assassin, Heinz Kruger, who shoots Erskine, killing him. Kruger grabs the last vial of the Super-Soldier Serum and escapes the facility into the streets of New York. Rogers runs after Kruger, using his new strength and stamina to run down Kruger's car on foot. Despite attempting to escape in a submarine, Rogers manages to catch Kruger, but the vial of Super Soldier Serum is broken in the process and the assassin immediately commits suicide by cyanide capsule before he can be interrogated for information.",
        "With Erskine dead and the super-soldier formula lost, the SSR is ordered to join the war and engage HYDRA directly, however, Philips decides to leave Rogers behind and allow scientists to study him in an attempt to rediscover Erskine's formula. U.S. Senator Brandt approaches Rogers and instead offers him the chance to tour the nation for the USO to promote war donations, using his image as the strong, ideal soldier as a symbol for the public to rally behind, which Rogers accepts. During his work for the USO Rogers preforms in scripted stage shows as the star spangled character 'Captain America'. As Rogers continues touring across the country Captain America gains great popularity among the public, leading to increasingly more elaborate shows as well as making appearances in film strips, comic books, and other memorabilia. Eventually, Rogers begins to grow weary of being paraded around while not being able to have a more direct role alongside those actively fighting in the war.",
        "Meanwhile, Schmidt unveils his new Tesseract powered weaponry to three Nazi officers sent to oversee his operation, but uses the weapon to kill the officers after they realize that Germany is among a list of Schmidt’s intended targets. Schmidt uses this moment to declare his secession from the Third Reich, claiming that HYDRA could grow no further in Hitler's shadow and will now follow his agenda, rather than the Fuhrer's. HYDRA continued to siphon energy from the Tesseract, using the stored energy to create a variety of weapons and integrated it into a range of vehicles and other technology, quickly giving the faction the potential to become a major threat to the war front, and the world at large. In 1943, while on tour in Italy performing for active servicemen, as well as encountering his colleagues from the Strategic Scientific Reserve, Rogers learns that his friend Bucky’s unit was lost in a battle against Schmidt's forces. Despite Colonel Philips’ insistence on the vainness of the situation, Rogers refuses to believe that Barnes is dead and becomes determined to mount a solo rescue attempt, receiving help from Peggy Carter and Howard Stark, who fly him behind enemy lines. Rogers manages to sneak into HYDRA’s main factory where he finds and frees most of the captive soldiers who begin a riot and start escaping while Rogers continues on to find Barnes, who he discovers in a separate room where he was being operated on.",
        "Schmidt, seeing the prisoners escaping and Rogers moving through the facility, sets the factory to self-destruct to cover HYDRA’s operations and evacuate to another facility. As the building begins to detonate, Schmidt confronts Rogers on a high catwalk where he makes light of his similarities to Rogers following their mutual use of the super soldier serum. Schmidt expresses his belief that they have risen above the visage of normal humans before revealing his face to be a mask, removing it to display the red, skull-like face that earned him the sobriquet 'the Red Skull'. Schmidt and Zola make their escape while Rogers leads Barnes to the roof where they both barely manage to escape the factory themselves before regrouping with the escaped soldiers and marching back to base.",
        "Following the liberation of the allied prisoners, Rogers gains his superior officers’ respect and acknowledgement as a soldier and is given high rank and the chance to fight as Captain America, as a key figure on the war front opposing HYDRA directly. Rogers recruits Barnes, Dum Dum Dugan, Gabe Jones, Jim Morita, James Montgomery Falsworth, and Jacques Dernier as his personal team of Howling Commandos to take out the other known HYDRA operations. Howard Stark outfits Rogers with advanced equipment, including a durable, custom combat uniform that retaines Rogers’ Captain America motif and a circular shield made of Vibranium, a rare, nigh-indestructible metal. In the following months Rogers and his Howling Commandos lead a strong offensive, sabotaging various HYDRA operations, much to the Red Skull’s frustration.",
        "The team later assaults a train carrying Arnim Zola. Rogers and Barnes engage in a fight with the soldiers on the train, during which Barnes falls from the train to his apparent death, while Gabe Jones locates Zola on the train and captures him. Rogers is deeply affected by the loss of his best friend and is convinced by Peggy Carter to use his sorrow as motivation to put an end to HYDRA for good. Using information extracted from Zola, the final HYDRA stronghold is located and Rogers leads an attack to stop Schmidt from using weapons of mass destruction on American cities.",
        "Rogers climbs aboard Schmidt's massive aircraft bomber, the Valkyrie, as it takes off. During the subsequent fight, a machine containing the Tesseract is damaged. Schmidt physically handles the Cosmic Cube, causing him to dissolve in a bright light. The cube falls to the floor, burning through the plane and falling into Earth's ocean. Seeing no way to land the plane without the risk of detonating its weapons, Rogers instead crashes it on the Arctic shelf while making a sorrowful goodbye to Carter, making a mock promise to take her dancing, knowing he'd never be able to make the date. Stark later recovers the Cosmic Cube from the ocean floor, but is unable to locate Rogers' body or Schmidt's aircraft.",
        "Rogers awakens in a 1940s-style hospital room. Deducing from an anachronistic radio broadcast that he was out of place, he flees outside into what is revealed to be present-day Times Square, where Nick Fury tells him he has been 'asleep' for nearly 70 years. Rogers breathes heavily and sadly reveals that he had a date. Sometime later, Fury approaches Rogers, proposing a mission with worldwide ramifications. (It then cuts to a short teaser for The Avengers.)" 
    ], 
    "director": [
        "Joe Johnston"
    ],
    "producers": [
        "Victoria Alonso",
        "Mitchell Bell",
        "Mike Bodkin",
        "Stephen Broussard",
        "Louis D'Esposito",
        "Kevin Feige",
        "Alan Fine",
        "Nigel Gostelow",
        "Joe Johnston",
        "Stan Lee",
        "David Maisel",
        "Richard Whelan"
    ],
    "screenwriters": [
        "Christopher Markus",
        "Stephen McFeely"
    ],
    "castnames": [
        "Chris Evans as Steve Rogers / Captain America",
        "Hayley Atwell as Peggy Carter",
        "Sebastian Stan as Bucky Barnes",
        "Tommy Lee Jones as Colonel Chester Phillips",
        "Hugo Weaving as Johann Schmidt / Red Skull",
        "Dominic Cooper as Howard Stark",
        "Richard Armitage as Heinz Kruger",
        "Stanley Tucci as Dr. Abraham Erskine",
        "Samuel L. Jackson as Nick Fury",
        "Toby Jones as Arnim Zola",
        "Neal McDonough as Dum Dum Dugan",
        "Derek Luke as Gabe Jones",
        "Kenneth Choi as Jim Morita",
        "JJ Feild as James Montgomery Falsworth"
    ], 
    "castprofiles": [
        "img/marvel/chris-evans.jpg",
        "img/marvel/hayley-atwell.jpg",
        "img/marvel/sebastian-stan.jpg",
        "img/marvel/tommy-lee-jones.jpg",
        "img/marvel/hugo-weaving.jpg",
        "img/marvel/dominic-cooper.jpg",
        "img/marvel/richard-armitage.jpg",
        "img/marvel/stanley-tucci.jpg",
        "img/marvel/samuel-l-jackson.jpg",
        "img/marvel/toby-jones.jpg",
        "img/marvel/neal-mcdonough.jpg",
        "img/marvel/derek-luke.jpg",
        "img/marvel/kenneth-choi.jpg",
        "img/marvel/jj-feild.jpg"
    ], 
    "releasedate": "June 22, 2011",
    "runningtime": "124 minutes",
    "boxoffice": 370.6,
    "genre": "Action, Adventure, Sci-Fi",
    "rating": "6.8 / 10",
    "trailer": "https://www.youtube.com/v/JerVrbLldXw",
    "images": [
        "img/marvel/movies/captain-america-00.jpg",
        "img/marvel/movies/captain-america-01.jpg",
        "img/marvel/movies/captain-america-02.jpg"
    ]
}