{
    "id": "the-avengers", 
    "name": "The Avengers", 
    "plot": [
        "After being exiled from the Nine Realms following his actions in Asgard, Loki wanders the periphery of outer space for over a year before coming into contact with the Other, the servant of a mysterious warlord. The Other makes a deal with Loki: in exchange for recovering the Tesseract, a powerful energy source being studied by S.H.I.E.L.D. on Earth, his master promises to give Loki command over the Chitauri, a warmongering race of cyborgs, so he may conquer humanity. Seeing this as a chance for greatness, Loki accepts. On Earth, S.H.I.E.L.D. Director Nick Fury and his deputy director, Maria Hill are called to the Joint Dark Energy Mission Facility in the Mojave Desert where the Tesseract is being researched by Dr. Erik Selvig. The Tesseract has recently begun emitting strange quantities of energy on its own accord, prompting the facility to be evacuated. Before any necessary precautions can be made, the Tesseract activates, opening a portal from which Loki appears. Announcing his intention to conquer Earth, Loki steals the Tesseract and uses an alien scepter, given to him by the Other, to enslave the minds of Dr. Selvig and Agent Clint Barton, aiding him in his getaway. Despite the efforts of Director Fury and Commander Hill to stop him, Loki escapes. In response to the attack, Fury reactivates the Avengers Initiative.",
        "Despite orders from the World Security Council to proceed with another alternative, Fury sends Agent Natasha Romanoff to locate Bruce Banner, who has been living in Kolkata, India as a doctor, and Agent Phil Coulson to recruit Tony Stark; both geniuses are recruited to help locate the Tesseract. Fury himself meets with Steve Rogers, informing him of Loki's theft of the Tesseract, requesting his help in recovering it and subduing the invader. All three men accept the offer, though Rogers is reluctant to do anything involving the Tesseract after his experiences with it in World War II. Banner is also hesitant to assist, fearing that his alter-ego, Hulk, may cause mayhem. The group, minus Stark, gathers on the Helicarrier, where Banner starts tracking the gamma radiation emitted by the Tesseract, while S.H.I.E.L.D tries to find Loki. Loki is discovered in Stuttgart, Germany, where he terrorizes a crowd of people attending a gala, providing a distraction so that the brainwashed Barton may retrieve iridium to stabilize the Tesseract. Romanoff and Rogers, the latter now in uniform as Captain America, arrive to apprehend Loki, with Rogers and Loki engaging in an even fight until the timely intervention of Stark, forcing Loki to surrender. After capturing him, they board a quinjet and start their return trip to the Helicarrier, when a lightning storm suddenly forms, and out of nowhere, Thor appears, having been transported to Earth by Odin.",
        "Thor takes Loki from the group's custody and carries him to a nearby forest. Thor attempts to persuade Loki into abandoning his campaign and returning to Asgard, but Loki, blinded by his jealousy of Thor and contempt towards Odin, refuses. Stark flies in and attacks Thor, engaging him in a battle that levels part of the forest. Before any further damage can be done, Rogers intervenes and attempts to get Thor to stand down; Thor responds by lunging at Rogers with Mjølnir, only for the captain's shield to absorb the blow. Thor finally agrees to work with the humans, and joins them in returning Loki to the Helicarrier.",
        "On the Helicarrier, Loki is imprisoned inside a cage designed to hold Banner as the Hulk, and Fury attempts to interrogate him regarding the Tesseract's location, but Loki remains silent. Thor reveals Loki's plan to the Avengers: with the Tesseract, Loki hopes to open a portal that will allow the Chitauri access to Earth, thus beginning a planetary takeover. While Stark and Banner work on locating the Tesseract, Stark is intrigued by Banner's level of control over the Hulk and shocks him to see how he would react. Rogers is clearly annoyed by Stark's erratic behavior and disrespect towards authority, and tries to get him to follow orders more carefully, instigating a rivalry between the two. Amidst their arguments, they begin to question S.H.I.E.L.D.'s intentions, deducing that Fury was hiding something regarding their plans with the Tesseract. Stark reveals that he had begun hacking the agency's mainframe to unlock their secrets, while Rogers leaves to investigate the restricted areas of the Helicarrier for himself. Both Stark and Rogers' investigations stumble upon a S.H.I.E.L.D. project known only as 'Phase 2', which they realize is in fact a program meant to utilize the Tesseract's power to make weapons of war.",
        "The Avengers confront Fury with their discoveries, to which he reveals that S.H.I.E.L.D. began using the Tesseract to manufacture weapons in response to the Asgardian incident in Puente Antiguo the previous year, which revealed to humanity the existence of powerful and potentially hostile alien life. A massive argument ensues, during which Barton, accompanied by various soldiers also working for Loki, attack the Hellecarrier, crippling one if its engines. The resulting explosion destroys the lab that the group is in, causing Romanoff and Banner fall into the boiler area, where they are trapped by wreckage. Despite Romanoff's attempts at calming him down, the injured Banner transforms into the Hulk, and chases Romanoff throughout the Helicarrier. Thor comes to her rescue and brawls with Banner, only to be outclassed in strength. A S.H.I.E.L.D. jet attempts to lure Banner away from Thor, only for Banner to leap at the jet and tear it apart. The jet explodes, and Banner is sent careening away from the Helicarrier.",
        "Rogers and Stark try to repair the damaged engine, but their efforts are hindered by Loki's underlings. Romanoff confronts Barton, and after an intense fight, she is able to break Loki's control by delivering a concussive blow to Barton's head. Thor attempts to prevent Loki from escaping, but is tricked by an illusion of Loki and trapped in his former prison cell. Agent Coulson attempts to save Thor, but Loki stabs him through the chest with his scepter, and then jettisons Thor from the Helicarrier. Thor breaks free from the cell at the last second, landing in a field. Rogers and Stark are eventually able to overcome their aggressors and get the Helicarrier airborne again, but the victory is bittersweet as Loki escapes and Coulson dies from his injury.",
        "Fury attempts to use Coulson's death to motivate the Avengers into cooperating as a team, but Rogers and Stark get into another argument. Amidst their argument, the two realize that Loki plans to open the portal above Stark Tower, at the center of New York City, in an attempt to satisfy his own ego. Rogers, Romanoff, and Barton take a quinjet to New York City, following Stark in his suit. Stark arrives first, failing to stop Dr. Selvig from using the Tesseract, in conjunction with a device he built, to open the portal. Stark confronts Loki, the two engaging in a brief battle of wits, with Stark failing to intimidate Loki with threats regarding the Avengers. Loki unsuccessfully tries to possess Stark, as his Arc Reactor physically blocks the scepter's power, and instead throws him through a window. Fortunately, Stark manages to activate his Mark VII armor, which attaches itself to Stark before he can hit the ground. Stark then attempts to incapacitate Loki, but Selvig's device activates, opening a portal above New York from which the Chitauri fleet emerges, beginning Loki's invasion.",
        "Rogers, Romanoff, Barton, and Thor soon arrive and assist Stark against the Chitauri. Not expecting such a resistance, the Chitauri are initially overwhelmed, but their sheer numbers soon become an issue. Banner arrives on a motorbike, and uses a special technique he mastered to willingly transform into the Hulk, giving the Avengers an edge against the Chitauri. The team fights through hordes of Chitauri, and during the battle, Loki is attacked by Banner and beaten into submission. Romanoff makes her way to Selvig's device, where Selvig, freed of Loki's control, reveals that Loki's scepter can be used to close the portal. Meanwhile, the World Security Council attempts to end the invasion by launching a nuclear missile at Manhattan. Iron Man intercepts the missile and takes it through the portal toward the Chitauri fleet before running out of power and plummeting back to Earth. Banner catches Stark as he falls, while the Chitauri fleet is decimated by the nuclear explosion, effectively disabling the Chitauri forces on Earth. Romanoff then closes the portal, the battle finally won.",
"The world, changed forever, is taken over by the idea of a superhero team. The Avengers become the center of media attention, admired by the public as heroes, but are also met with some concern and fear, with some finding their appearance during the battle to be too coincidental. All joining in Central Park, the Avengers and S.H.I.E.L.D. watch as Thor escorts Loki and the Tesseract to Asgard. Afterward, the Avengers diverge, though Fury notes that at such a time that a new world-threatening menace emerges, the team will reassemble.",
        "Meanwhile, the Other meets with his master and informs him of Loki's failure. He shares his concerns over the strength of Earth's heroes, commenting that attempting to challenge them again would be 'to court Death.' At this, the master, Thanos, smiles sadistically. Before they had disassembled, the Avengers gathered at a shawarma restaurant and ate in silence."
    ], 
    "director": [
        "Joss Whedon"
    ],
    "producers": [
        "Victoria Alonso",
        "Mike Bodkin",
        "Louis D'Esposito",
        "Jon Favreau",
        "Kevin Feige",
        "Alan Fine",
        "Jeremy Latcham",
        "Stan Lee",
        "Patricia Whitcher"
    ],
    "screenwriters": [
        "Zak Penn",
        "Joss Whedon"
    ],
    "castnames": [
        "Robert Downey Jr. as Tony Stark / Iron Man",
        "Chris Evans as Steve Rogers / Captain America",
        "Mark Ruffalo as Bruce Banner / The Hulk",
        "Chris Hemsworth as Thor",
        "Scarlett Johansson as Natasha Romanoff / Black Widow",
        "Jeremy Renner as Clint Barton / Hawkeye",
        "Tom Hiddleston as Loki",
        "Clark Gregg as Agent Phil Coulson",
        "Cobie Smulders as Agent Maria Hill",
        "Stellan Skarsgård as Selvig",
        "Samuel L. Jackson as Nick Fury",
        "Gwyneth Paltrow as Pepper Potts",
        "Paul Bettany as Jarvis (voice)",
        "Alexis Denisof as The Ohter",
        "Tina Benko as Nasa Scientist"
    ], 
    "castprofiles": [
        "img/marvel/robert-downey-jr.jpg",
        "img/marvel/chris-evans.jpg",
        "img/marvel/mark-ruffalo.jpg",
        "img/marvel/chris-hemsworth.jpg",
        "img/marvel/scarlett-johansson.jpg",
        "img/marvel/jeremy-renner.jpg",
        "img/marvel/tom-hiddleston.jpg",
        "img/marvel/clark-gregg.jpg",
        "img/marvel/cobie-smulders.jpg",
        "img/marvel/stellan-skarsgard.jpg",
        "img/marvel/samuel-l-jackson.jpg",
        "img/marvel/gwyneth-paltrow.jpg",
        "img/marvel/paul-bettany.jpg",
        "img/marvel/alexis-denisof.jpg",
        "img/marvel/tina-benko.jpg"
    ], 
    "releasedate": "May 4, 2012",
    "runningtime": "143 minutes",
    "boxoffice": 1518,
    "genre": "Action, Adventure, Sci-Fi",
    "rating": "8.2 / 10",
    "trailer": "https://www.youtube.com/v/eOrNdBpGMv8",
    "images": [
        "img/marvel/the-avengers-00.jpg",
        "img/marvel/iron-man-00.jpg",
        "img/marvel/iron-man-3-00.jpg"
    ]
}