{
    "id": "thor-the-dark-world", 
    "name": "Thor: The Dark World", 
    "plot": [
        "In the distant past, a cosmic event known as the Convergence occurs, opening portals between the Nine Realms. A sinister race called the Dark Elves attempts to use the Convergence as a way of unleashing the Aether, a force of destruction with the capability of destroying the entire galaxy. The exact origin of the Aether is unknown, but it is known that it is one of six powerful objects that predate the universe itself. The leader of the Dark Elves, Malekith, nearly succeeds in using the Aether to cause the instantaneous destruction of the Nine Realms under the misguided belief that he can recreate them in his own image. He is opposed by Bor, the then-king of Asgard and the father of Odin, who uses the Bifrost to rip the Aether from Malekith's grasp just as he attempted to enact his plan, robbing the Dark Elves of their most potent weapon. Driven back to their homeworld, Svartalfheim, it becomes apparent that the Dark Elves cannot defeat the Asgardians and are all but wiped out in the battle. While the Asgardians, unable to destroy the Aether, seal it away in a place it can never be found, Malekith, his lieutenant Algrim, and various survivors manage to escape into suspended animation, vowing to one day return and finish their plan.",
        "5,000 years later, some time after the War for Earth, Loki is brought before Odin in shackles. The Allfather gives Loki a life-sentence in prison for his crimes against humanity. Meanwhile, in Vanaheim, home of the Vanir, Thor, alongside warriors Fandral, Volstagg, Hogun, and Sif, fights against the Marauders, a ragtag group of invaders that have been systematically terrorizing the Nine Realms for the past two years. The Asgardians win the battle, and while Hogun remains on Vanaheim to help his people rebuild, Thor and his friends return to Asgard via the Bifrost Bridge, which was repaired by the power of the Tesseract. A party is held in celebration for Thor's victory, but he leaves quickly. He visits Heimdall daily, asking each time how Jane Foster is faring. Odin clearly does not approve of Thor's affections for Foster as she will be dead long before him.",
        "Back on Earth, Jane Foster is in London, having been called there by Erik Selvig to investigate readings of unknown nature. After having not heard from Thor for some time, she goes on a date with a man called Richard. Their date is quickly interrupted by Darcy Lewis, who explains that Foster's scientific equipment has been picking up strange signals, signals that haven't been detected since the events that took place in New Mexico two years prior. They get in a car where Lewis' own intern, Ian Boothby is waiting for them, and drive to where the signal is the highest and end up at an abandoned storage house. They find that a number of portals have opened, linking the Earth to several different worlds and altering the laws of physics, causing gravity to shift without warning. While Lewis and Boothby continue to play around with the portals, Foster is swallowed up by one of them and transported to an unknown planet. She finds herself in a dark chasm, where a strange vault is located. Upon touching the vault, a red substance, the Aether, emerges from it and infests her body. Passing out, Foster is teleported back to Earth, waking up five hours later. She walks outside where Lewis and Boothby have been waiting. The police had been called there by Lewis and consequently attempt to arrest the three for trespassing on private property; a policeman tries to touch Foster, but the Aether forces him away. Thor suddenly arrives, seeking to investigate Foster's well-being, as Heimdall lost sight of her after she disappeared. While overjoyed to see him, Foster slaps Thor in the face for taking two years to visit her even though he was on Earth during the battle of New York. Thor apologizes to her, but then takes her to Asgard to investigate the nature of the Aether.",
        "Once there, Heimdall greets them, but Jane Foster is quickly taken to the healing chambers so that they can learn what's wrong with her. They find the Aether in her body but they don't know what it is. A physician called Eir tries to remove the Aether from Foster but fails. Odin, furious that a human has entered Asgard, orders for her to be taken back to Earth, but when a guard touches her wrist, the Aether reacts defensively just as it did with the police. Odin, recognizing the Aether, tells Foster of its many possible origins using the Book of Yggdrasil, and how the Dark Elves nearly used it to destroy the realms. While Odin works to find a way to remove the Aether without killing Jane, Frigga — Odin's wife, Thor's mother, and Loki's adoptive mother — befriends her. Frigga has secretly been attempting to convey her disappointment to Loki regarding his actions, but he has rebuffed her every time.",
        "Meanwhile, alerted by Foster's use of the Aether, Malekith and his ilk awake from their long sleep. Under Malekith's orders, Algrim allows himself to be captured by the Asgardians while in disguise as a Marauder and, using vile technology, turns himself into a Kursed, a superpowered warrior that the Dark Elves used frequently in their war against the Asgardians. He frees all the prisoners except Loki and they start a prison riot, distracting the Asgardians so that Malekith can lead his squadron of ships into Asgard with little opposition. A battle takes place, during which the palace is breached and heavily damaged. Frigga, having suspected the diversion, lures Malekith into a duel by creating a holographic replica of Foster. Frigga nearly succeeds in besting Malekith, but Algrim intervenes and mortally wounds her when she refuses to give up Foster and the Aether's location. In retaliation, an enraged Thor disfigures Malekith's face with a bolt of lightning, forcing the Dark Elves to retreat. Frigga then dies from her injury.",
        "A funeral is later held for the dead Asgardians and Frigga, and a grief stricken Odin has Jane Foster imprisoned. Thor knows that Malekith will return for Foster, but Odin, blinded by hate and grief, refuses to release her. So, Thor comes up with a plan to move her, even though he'd be committing treason. With Heimdall distracting Odin from them, Thor has Loki freed from his cell, as Loki knows of secret portals that could transport Foster to another world, drawing Malekith away from Asgard. With help from Sif, Fandral, and Volstagg, Thor, Foster and Loki hijack a downed Dark Elf ship and make their way out of Asgard and to a hidden portal that teleports them to Svartalfheim. As they make their escape, however, Foster's body is slowly being infested by the Aether, draining her of life.",
        "The trio lands in the wastelands of Svartalfheim and by then, Foster's body has completely channeled the Aether, enhancing her perceptions but weakening her physically. Melekith senses the Aether's transfer and confronts the trio on Svartalfheim, and at that moment, Loki appears to betray Thor, cutting off his hand and giving Foster to Malekith willingly. Loki tells Malekith that in return for the Aether, he wants a front row seat to watch Asgard's destruction. Malekith then proceeds to drain the Aether from Foster's body and into himself, but Loki's betrayal is revealed to be a ruse, and Thor's injury is revealed to have been nothing more than a holographic projection meant to lull Malekith into a false sense of security. Calling for Mjølnir, Thor tries to destroy the Aether, but fails as it is indestructible. Algrim then battles Thor while Malekith and his minions leave the planet, and Algrim quickly gains the upper hand against Thor. Loki comes to Thor's aid, stabbing Algrim through the chest with the sword, but this has no effect on the Kursed, who seizes Loki and drives the sword into his own body. Loki manages to press one of Algrim's implosion bombs, however, and sets it off, destroying Algrim. Loki then apologizes to Thor for his actions, and seems to die in his arms. After mourning Loki, Thor and Foster then enter a cave, believing that they have failed in stopping Malekith. Suddenly, Foster's cell phone gains reception, and they venture deeper into the cave, finding a portal. The portal teleports them safely back to London. Meanwhile, an Einherjar Guard appears in the same area where Loki died, and returns to Asgard to inform Odin of what transpired.",
        "While Jane Foster has been in Asgard, Darcy Lewis has been fruitlessly trying to reach S.H.I.E.L.D. when she and Ian Boothby see on the news that Erik Selvig has been running around naked at Stonehenge, and has now been put in a retirement home for psychiatric care. They go there to get him out, and he tells them his sanity was shaken after being hypnotized by Loki during the War for Earth. For the past several months, Selvig has studied the effects of the Convergence and has developed devices which can teleport people to different worlds. They meet up with Thor and Foster, and Selvig tells them that the people who lived in England after the previous Convergence had built certain objects to create a secret map to where the Convergence would reach its peak. The location is revealed to be Greenwich. After putting two and two together, Foster theorizes that Malekith plans to spread the Aether through the portals so that he may destroy all of the worlds at once.",
        "They travel to Greenwich the next morning, and when they arrive, they find that a number of portals have opened up above the city, a sign that the Convergence is nearing its peak. Malekith soon arrives, and Thor engages him in battle, with both evenly matched. The fight takes them through various portals throughout the city, transporting them to different worlds. While the two are fighting, the scientists use Selvig's devices to deal with the Dark Elf soldiers, accidentally summoning a Jotunheim Beast in the process. Thor and Malekith are soon separated by one of the portals, and Malekith, now unopposed, unleashes the Aether into the portals. Thor soon regroups with his friends and takes Selvig's devices, noting that while the Aether might be indestructible, Malekith himself is not. Using the devices, Thor impales Malekith with them, allowing Jane to teleport him back to Svartalfheim, stopping his attack. However, Malekith's damaged flagship starts to crash, and nearly crushes Thor and Jane, when Selvig uses the last of his devices to teleport it away; it ends up on Svartalfheim and lands on Malekith, killing the Dark Elf leader. The portals then close, and the ordeal is finally over.",
        "Some time later, Thor returns to Asgard, where Odin congratulates him on his victory despite the crimes he committed to do so. Odin comments that Thor will make a wise king, but Thor responds by saying he is not ready to bear the weight of the throne. Thor leaves Asgard to reunite with Jane on Earth, but as he leaves, Odin is revealed to be Loki, having faked his death and usurped Odin's throne. Later, Sif and Volstagg hand over the captured Aether to Taneleer Tivan, the Collector. Tivan appears eager to take it, but is curious as to why the Asgardians don't just keep it secured in their own vault. Volstagg explains that the Tesseract is already on Asgard, and that to keep two Infinity Stones in the same place would be unwise. As they leave, the Collector remarks to his assistant Carina, 'One down, five to go. Thor returns to Earth, where he happily reunites with Jane, unaware that the Jotunheim Beast that was teleported to Earth during the Convergence is still running rampant through London chasing a bird.'"
    ], 
    "director": [
        "Alan Taylor",
        "James Gunn (mid-credits-scene)",
        "Tim Miller (prologue)"
    ],
    "producers": [
        "Kevin Feige",
        "Victoria Alonso",
        "Louis D'Esposito",
        "Alan Fine",
        "Craig Kyle",
        "Stan Lee"
    ],
    "screenwriters": [
        "Christopher Yost",
        "Christopher Markus",
        "Stephen McFeely"
    ],
    "castnames": [
        "Chris Hemsworth as Thor",
        "Natalie Portman as Jane Foster",
        "Tom Hiddleston as Loki",
        "Anthony Hopkins as Odin",
        "Christopher Eccleston as Malekith",
        "Jaimie Alexander as Sif",
        "Zachary Levi as Fandral",
        "Ray Stevenson as Volstagg",
        "Tadanobu Asano as Hogun",
        "Idris Elba as Heimdall",
        "Rene Russo as Frigga",
        "Adewale Akinnuoye-Agbaje as Aldrim / Kurse",
        "Kat Dennings as Darcy Lewis",
        "Stellan Skarsgård as Erik Selvig",
        "Alice Krige as Eir"
    ], 
    "castprofiles": [
        "img/marvel/chris-hemsworth.jpg",
        "img/marvel/natalie-portman.jpg",
        "img/marvel/tom-hiddleston.jpg",
        "img/marvel/anthony-hopkins.jpg",
        "img/marvel/christopher-eccleston.jpg",
        "img/marvel/jaimie-alexander.jpg",
        "img/marvel/zachary-levi.jpg",
        "img/marvel/ray-stevenson.jpg",
        "img/marvel/tadanobu-asano.jpg",
        "img/marvel/idris-elba.jpg",
        "img/marvel/rene-russo.jpg",
        "img/marvel/adewale-akinnuoye-agbaje.jpg",
        "img/marvel/kat-dennings.jpg",
        "img/marvel/stellan-skarsgard.jpg",
        "img/marvel/alice-krige.jpg"
    ], 
    "releasedate": "November 8, 2013",
    "runningtime": "112 minutes",
    "boxoffice": 644.8,
    "genre": "Action, Adventure, Fantasy",
    "rating": "7.1 / 10",
    "trailer": "https://www.youtube.com/v/npvJ9FTgZbM",
    "images": [
        "img/marvel/thor-the-dark-world-00.jpg",
        "img/marvel/iron-man-00.jpg",
        "img/marvel/iron-man-2-00.jpg"
    ]
}