{
    "id": "thor", 
    "name": "Thor", 
    "plot": [
        "Two physicists, Jane Foster, Erik Selvig, and their political science intern, Darcy Lewis, are in the New Mexico desert, working from a four-wheel drive van while conducting research on an aurora-borealis-type phenomenon. Suddenly a large tornado/lightning storm develops and they drive towards it to investigate. The van hits a man from inside the maelstrom and they stop. They find a man, a well-built blond, semi-conscious.In Asgard, Odin describes a battle in 900 AD between the Frost Giants and Asgardians. The Asgardians win, take possession of the powerful Casket of Ancient Winters, and return to their realm. Odin is talking to his two sons, one an energetic blond named Thor, the other a more thoughtful dark-haired boy, named Loki. Odin says both of them are worthy but only one can be king of Asgard. Years later Asgard is having an elaborate ceremony. The blond boy is now an adult and he's being formally recognized as crown prince. Loki looks on enviously. Before Odin can follow through with the proclamation, he senses the presence of intruders. Three Frost Giant infiltrate the secure rooms that hold the Frost Giant's powerful casket. However, The Destroyer appears and stops the intruders from reattaining the casket, killing all three. Examining the remains, Odin seems calm, yet Thor is angry and wants to attack. Odin disagrees.",
        "Thor gathers by Loki and his close friends, Volstagg, Fandral, Hogun, and Sif, and they ride out to the Bifrost Bridge. The guardian, Heimdall, allows them to pass and the six are transported to the Frost Giants' domain, Jotunheim, a frozen, crumbling wasteland. They confront the Frost Giant King, Laufey, who taunts the Asgardian heroes. More Frost Giants surround the six as Laufey allows them the chance to leave peacefully. However, Thor reacts brashly to a Frost Giant's insult and a battle starts. During the battle, Loki experiences an unusual reaction when he is touched by a frost giant. Laufey releases a huge beast and the Asgardians retreat to the Bifrost. Thor kills the beast but once again the team is surrounded and things look desperate. Odin arrives and intervenes to save the warriors, apologizing to Laufey for the intrusion and attempting to reinstate peace, but Laufey states that they are beyond reason, that the Frost Giants are now at war with Asgard. He attempts to stab Odin, who blasts Laufey back and takes the young Asgardians home.",
        "Back at the Asgard side of the portal, Odin lets the four friends go and confronts Thor and Loki. Odin is furious that Thor has dragged Asgard back into war, and tells Thor he is not fit to be king. He strips him of his power, banishes him to Earth and sends his hammer, Mjølnir, after him a few seconds later, saying that whosoever wields the hammer, and is worthy of it, shall posses the power of Thor. On Earth Thor is immediately hit by Jane Foster's truck as they drive into the storm he emerged from. Thor, faintly begins to question where he is and becomes aggressive to the point that Darcy tases him, knocking him out. The three scientists load him into their van and take him to the hospital. Once again he starts fighting as he wakes up and he's eventually tranquilized. Erik tries to get Jane to leave him be, saying he is some kind of nut, but she is curious, and attracted to him.",
        "When the scientists return to their outpost in town they discover S.H.I.E.L.D. confiscating all of their equipment and research in connection to the recent atmospheric disturbances, and the appearance of Thor's hammer. Unsure of what to do, the trio go back to the hospital but Thor has escaped. As they drive off in the van, they hit the Asgardian man again and knock him out, but this time they take him with them. Jane gives him civilian clothes that belonged to her ex-boyfriend. After overhearing locals discussing a satellite crash 50 miles due west, Thor decides to go there and once again Erik tries to get Jane to leave him alone. Thor walks about the town and tries to get a horse in a pet store. Jane appears and gives him a ride and the two head west in the van.",
        "At the satellite crash site a crowd of local towns people have gathered; people are partying and trying to lift the hammer from the crater. One of the locals tries to pull the hammer out with his pickup truck. Government agents from S.H.I.E.L.D. arrive take over the site, setting up a temporary camp to study the hammer. After dark, Jane and Thor arrive on the scene. Thor infiltrates the encampment while Jane huddles in safety. After beating up many agents, and being targeted by Hawkeye. Thor finally reaches the hammer, but is unable to lift it. He howls at his powerlessness and drops to the ground, putting up no fight as S.H.I.E.L.D. agents close in and take him. In Asgard Thor's four friends begin to suspect Loki had something to do with Thor's banishment. Loki realizes that he is not a pure Asgardian and Odin admits that Loki was taken from Jotunheim as an infant and raised as his own. Loki is confused and angry as Odin falls into a coma like state called the 'Odinsleep', leaving Loki to become acting king.",
        "Back on Earth Agent Phil Coulson questions Thor, and when he leaves him alone briefly, Loki appears in the room. Loki tells Thor that Odin is dead and he cannot come back to Asgard, leaving Thor distraught. Erik arrives and lies to the S.H.I.E.L.D. agents, telling them that Thor is Jane's ex-husband and is under the influence of steroids. Somehow he has faked a driver's license. Coulson lets Erik take Thor, who surreptitiously grabs Jane's notebook on the way out. Back in town Erik takes Thor out for a drink, now trying to convince Thor to leave Jane alone due to the complications he has, and would continue to cause her. The two chug boilermakers and bond. Thor brings the drunk Erik to Jane's trailer. Thor and Jane go outside to gaze at the stars, and Thor explains the Nine Realms and the Bifrost Bridge to Jane. Jane figures the bridge is the theoretical Einstein-Rosen Bridge wormhole, the very same that she has been researching.",
        "Loki freezes Heimdall in Asgard, and uses the Bifrost to meet with Laufey. It is revealed that Loki was the one who let the Frost Giants into Asgard to try to retrieve the casket during Thor's coronation. He makes a deal with Laufey that he will let them into Asgard again to kill Odin and have their casket, and in return they will return home in peace. Loki then commands the Destroyer to go to Earth and kill Thor. The Destroyer arrives in the New Mexico desert and starts blasting everything with a heat ray. Thor and the three scientists attempt to get everyone away safely. Thor confronts the Destroyer and asks Loki, who can see and hear what is going on from Asgard, to leave the humans alone in return for himself. The Destroyer gives Thor a vicious backhand slap and sends him tumbling, apparently dead. Jane runs to the body in tears. However, Thor's selfless act of protection proves him worthy to once again wield Mjølnir, which frees itself from the crater and returns to Thor's hand. He is restored to full life and vigor and once again fitted in his red cape and armor. He easily defeats the Destroyer and tries to return to Asgard, promising Jane he will return.",
        "The frost giants invade Asgard through the portal, walking past the frozen Heimdall. Laufey goes to Odin's bed chamber and, as he prepares to kill the Norse god, Loki kills Laufey to appear to be the hero. Although frozen, Heimdall is conscious and manages to break free and brings Thor back to Asgard. Thor flies quickly to fight the frost giants. Loki goes to the Bifrost Portal and sets it up to destroy the ice planet Jotunheim. Thor tries to stop him and the two engage in combat. Thor immobilizes Loki with Mjølnir and starts to destroy the bridge to stop the portal. When the bridge shatters, the two brothers fall into space but Odin arrives and catches Thor, who holds Loki's staff. Loki admits defeat and allows himself to fall, disappearing into the void.",
        "All seems back to normal on Asgard, although Odin is saddened by the turn of events. Thor mourns for his brother and misses Jane, who he is unable to visit with the Bifrost now destroyed. However, Heimdall, gazing out over the severed edge of the Bifrost bridge, assures him that Jane is looking for him. Back on Earth Jane is in a new lab with new equipment, now being assisted by S.H.I.E.L.D. Afterwards, Selvig has been taken to a S.H.I.E.L.D. facility where he meets Nick Fury. Fury shows him the Tesseract in a briefcase, which he says could be a source of unlimited power. Loki appears in a reflection, invisible to Selvig and Fury, and says 'Well, I guess that's worth a look', which Selvig repeats due to Loki's subtle influence."
    ], 
    "director": [
        "Kenneth Branagh",
        "Joss Whedon (post-credits scene)"
    ],
    "producers": [
        "Victoria Alonso",
        "Mike Bodkin",
        "Michael Chong",
        "Louis D'Esposito",
        "Kevin Feige",
        "Alan Fine",
        "David J. Grant",
        "Craig Kyle",
        "Stan Lee",
        "David Maisel",
        "Patricia Whitcher"
    ],
    "screenwriters": [
        "Ashley Edward Miller",
        "Zack Stentz",
        "Don Payne",
        "J. Michael Straczynski",
        "Mark Protosevich"
    ],
    "castnames": [
        "Chris Hemsworth as Thor",
        "Natalie Portman as Jane Foster",
        "Tom Hiddleston as Loki",
        "Anthony Hopkins as Odin",
        "Stellan Skarsgård as Erik Selvig",
        "Kat Dennings as Darcy Lewis",
        "Clark Gregg as Agent Coulson",
        "Colm Feore as King Laufey",
        "Idris Elba as Heimdall",
        "Ray Stevenson as Volstagg",
        "Tadanobu Asano as Hogun",
        "Josh Dallas as Fandral",
        "Jaimie Alexander as Sif"
    ], 
    "castprofiles": [
        "img/marvel/chris-hemsworth.jpg",
        "img/marvel/natalie-portman.jpg",
        "img/marvel/tom-hiddleston.jpg" ,
        "img/marvel/anthony-hopkins.jpg",
        "img/marvel/stellan-skarsgard.jpg",
        "img/marvel/kat-dennings.jpg",
        "img/marvel/clark-gregg.jpg",
        "img/marvel/colm-feore.jpg",
        "img/marvel/idris-elba.jpg",
        "img/marvel/ray-stevenson.jpg",
        "img/marvel/tadanobu-asano.jpg",
        "img/marvel/josh-dallas.jpg",
        "img/marvel/jaimie-alexander.jpg"
    ], 
    "releasedate": "May 2, 2011",
    "runningtime": "114 minutes",
    "boxoffice": 449.3,
    "genre": "Action, Adventure, Fantasy",
    "rating": "7.0 / 10",
    "trailer": "https://www.youtube.com/v/JOddp-nlNvQ",
    "images": [
        "img/marvel/thor-00.jpg",
        "img/marvel/iron-man-00.jpg",
        "img/marvel/iron-man-3-00.jpg"
    ]
}